{
  "tutorials": [
    {
      "levelNumber": 1,
      "levelMechanic": "Queue",
      "description": "We'll introduce the queue. If it overflows, it's game over!",
      "steps": [
        {
          "title": "Introducing the Queue",
          "text": "As tickets come in, the dispatcher must get them to technicians. If you get too behind, it'll spell trouble!"
        }
      ]
    },
    {
      "levelNumber": 2,
      "levelMechanic": "Color Code",
      "description": "We'll introduce the color code. The right ticket needs to get to the right tech.",
      "steps": [
        {
          "title": "Color-Coding Tickets",
          "text": "Make sure the color shermie reach the color goal, to score points"
        }
      ]
    },
    {
      "levelNumber": 3,
      "levelMechanic": "Gates",
      "description": "We'll introduce Gates. Sometimes a tech is out of office and you can't get a ticket to them.",
      "steps": [
        {
          "title": "Gates barriers",
          "text": "Some goal zones would be closed at certain times, becareful and make sure to not reach one where the gate is closed"
        }
      ]
    },
    {
      "levelNumber": 4,
      "levelMechanic": "Bomb Shermie",
      "description": "We'll introduce Bomb Shermie. Some tickets are time-critical – take care of them fast!",
      "steps": [
        {
          "title": "Bomb Shermie",
          "text": "Some Shermies will be bombs, which needs to reach the goal as soon as possible"
        }
      ]
    },
    {
      "levelNumber": 5,
      "levelMechanic": "Toxic Shermie",
      "description": "We'll introduce Toxic Shermie. Some tickets need to be waited on and put back into the queue.",
      "steps": [
        {
          "title": "Toxic Shermie",
          "text": "Toxic Shermie are light color green, they will have enter the hopsital to clear away their toxicity"
        }
      ]
    },
    {
      "levelNumber": 6,
      "levelMechanic": "Powerup 1: Invulnerability",
      "description": "We'll introduce Powerup 1: Invulnerability. Some tickets are much simpler once you use the powerup!",
      "steps": [
        {
          "title": "Invulnerability Powerup",
          "text": "Shermie will recivice a # second invulnerability, which allows shermie to reach the goal unharmed"
        }
      ]
    },
    {
      "levelNumber": 7,
      "levelMechanic": "Powerup 2: Clense",
      "description": "We'll introduce Powerup 2: Clense. This powerup is super helpful, and you'll need it!",
      "steps": [
        {
          "title": "Powerup 2",
          "text": "This powerup will clear any amornelity of shermie that is currently being applied, instead it will turn in into a regular shermie"
        }
      ]
    },
    {
      "levelNumber": 8,
      "levelMechanic": "Powerup 3",
      "description": "We'll introduce Powerup 3. This powerup is super helpful, and you'll need it!",
      "steps": [
        {
          "title": "Powerup 3",
          "text": "Powerup 3 is going to make your life easier. Use it wisely and keep the queue under control."
        }
      ]
    },
    {
      "levelNumber": 9,
      "levelMechanic": "Ulmiate Test",
      "description": "",
      "steps": [
        {
          "title": "Last Test",
          "text": "Since you had learned all of the mechanics, this would the final test to see you got what it takes."
        }
      ]
    }
  ]
  
}
